In [1]:
# !pip install --upgrade pip

# Library supporting .xlsx file
# !pip install openpyxl

# Library supporting .ods file
# !pip install odfpy

# Library for google colab (Reading Datasets from google cloud)
# !pip install google-cloud
# !pip install google-cloud-vision

In [2]:
import pandas as pd


# income_and_tax = pd.read_excel('7.Income_and_tax_by_county_and_region_21_22.ods')
def merge_three_datasets(sheet_start, title_1, title_2, title_3):
    raw_1 = pd.read_excel('../datasets/House_price_to_workplace-based_earnings_ratio.xlsx', header=1, sheet_name=sheet_start)
    raw_2 = pd.read_excel('../datasets/House_price_to_workplace-based_earnings_ratio.xlsx', header=1, sheet_name=sheet_start+1)
    raw_3 = pd.read_excel('../datasets/House_price_to_workplace-based_earnings_ratio.xlsx', header=1, sheet_name=sheet_start+2)
        

    df_1a = pd.DataFrame(raw_1)
    df_1b = pd.DataFrame(raw_2)
    df_1c = pd.DataFrame(raw_3)

    flat_1a = pd.melt(df_1a, id_vars=['Code', 'Name'], var_name='Year',
                                value_name=title_1)
    flat_1b = pd.melt(df_1b, id_vars=['Code', 'Name'], var_name='Year',
                                value_name=title_2)
    flat_1c = pd.melt(df_1c, id_vars=['Code', 'Name'], var_name='Year',
                                value_name=title_3)
    
    flat_1a['Year'] = pd.to_datetime(flat_1a['Year'].str[-4:])
    flat_1b['Year'] = pd.to_datetime(flat_1b['Year'], format='%Y')
    flat_1c['Year'] = pd.to_datetime(flat_1c['Year'], format='%Y')
    
    return flat_1a.merge(flat_1b, on=['Code', 'Name', 'Year'], how='outer')\
                  .merge(flat_1c, on=['Code', 'Name', 'Year'], how='outer')

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

## Median house price, Gross annual, and its ratio from England and Wales, 1997-2022
### Country and Region

In [3]:
eng_cym_region = merge_three_datasets(3, title_1="Median_price", title_2="Median_earning", 
                                     title_3="price_to_earning")

eng_cym_region_low_q = merge_three_datasets(6, title_1="Low_q_Median_price", title_2="Low_q_Median_earning", 
                                           title_3="Low_q_price_to_earning")

eng_cym_region_merged = pd.merge(eng_cym_region, eng_cym_region_low_q, on=['Code', 'Name', 'Year'])
column_order = ['Code',	'Name',	'Year',	'Median_price', 'Low_q_Median_price', 
                'Median_earning', 'Low_q_Median_earning', 'price_to_earning', 'Low_q_price_to_earning']
eng_cym_region_merged = eng_cym_region_merged[column_order]
eng_cym_region_merged

,Code,Name,Year,Median_price,Low_q_Median_price,Median_earning,Low_q_Median_earning,price_to_earning,Low_q_price_to_earning
0,K04000001,England and Wales,1997-01-01,59950.0,42500.0,16885,12016,3.55,3.54
1,E92000001,England,1997-01-01,59995.0,43000.0,16958,12058,3.54,3.57
2,E12000001,North East,1997-01-01,46500.0,32000.0,15622,11197,2.98,2.86
3,E12000002,North West,1997-01-01,48500.0,34450.0,16107,11542,3.01,2.98
4,E12000003,Yorkshire and The Humber,1997-01-01,48500.0,35000.0,15538,11275,3.12,3.10
...,...,...,...,...,...,...,...,...,...
307,E12000006,East,2022-01-01,328000.0,240000.0,32539,24254,10.08,9.90
308,E12000007,London,2022-01-01,525000.0,385000.0,41866,30039,12.54,12.82
309,E12000008,South East,2022-01-01,370000.0,269950.0,34431,25260,10.75,10.69
310,E12000009,South West,2022-01-01,295000.0,217000.0,31339,23542,9.41,9.22
311,W92000004,Wales,2022-01-01,190000.0,138000.0,30596,23163,6.21,5.96

## Median house price, Gross annual, and its ratio from England and Wales, 1997-2022
### Country and Region

In [4]:
eng_cym_county = merge_three_datasets(9, title_1="Median_price", title_2="Median_earning", 
                                      title_3="price_to_earning")
eng_cym_county_low_q = merge_three_datasets(12, title_1="Low_q_Median_price", title_2="Low_q_Median_earning", 
                                           title_3="Low_q_price_to_earning")

eng_cym_county_merged = pd.merge(eng_cym_county, eng_cym_county_low_q, on=['Code', 'Name', 'Year'])
column_order = ['Code',	'Name',	'Year',	'Median_price', 'Low_q_Median_price', 
                'Median_earning', 'Low_q_Median_earning', 'price_to_earning', 'Low_q_price_to_earning']
eng_cym_county_merged = eng_cym_county_merged[column_order]
eng_cym_county_merged

,Code,Name,Year,Median_price,Low_q_Median_price,Median_earning,Low_q_Median_earning,price_to_earning,Low_q_price_to_earning
0,E10000003,Cambridgeshire,1997-01-01,66000.0,48000.0,17140,12637,3.85,3.80
1,E10000006,Cumbria,1997-01-01,50000.0,35000.0,16118,11244,3.10,3.11
2,E10000007,Derbyshire,1997-01-01,49000.0,36000.0,15371,11448,3.19,3.14
3,E10000008,Devon,1997-01-01,60000.0,45000.0,14203,10456,4.22,4.30
4,E10000011,East Sussex,1997-01-01,63000.0,45000.0,15330,11051,4.11,4.07
...,...,...,...,...,...,...,...,...,...
619,E10000029,Suffolk,2022-01-01,280000.0,215000.0,31414,23617,8.91,9.10
620,E10000030,Surrey,2022-01-01,500000.0,355000.0,36070,26448,13.86,13.42
621,E10000031,Warwickshire,2022-01-01,280000.0,206000.0,31605,23892,8.86,8.62
622,E10000032,West Sussex,2022-01-01,375000.0,280000.0,31497,24385,11.91,11.48
623,E10000034,Worcestershire,2022-01-01,269975.0,199975.0,29858,22893,9.04,8.74

## Median house price, Gross annual, and its ratio from England and Wales, 1997-2022
### Local Authority District

### N.B: Here some NaNs are observed

In [5]:
eng_cym_local = merge_three_datasets(9, title_1="Median_price", title_2="Median_earning", 
                                      title_3="price_to_earning")
eng_cym_local_low_q = merge_three_datasets(12, title_1="Low_q_Median_price", title_2="Low_q_Median_earning", 
                                           title_3="Low_q_price_to_earning")

eng_cym_local_merged = pd.merge(eng_cym_local, eng_cym_local_low_q, on=['Code', 'Name', 'Year'])
column_order = ['Code',	'Name',	'Year',	'Median_price', 'Low_q_Median_price', 
                'Median_earning', 'Low_q_Median_earning', 'price_to_earning', 'Low_q_price_to_earning']
eng_cym_local_merged = eng_cym_local_merged[column_order]
eng_cym_local_merged

,Code,Name,Year,Median_price,Low_q_Median_price,Median_earning,Low_q_Median_earning,price_to_earning,Low_q_price_to_earning
0,E10000003,Cambridgeshire,1997-01-01,66000.0,48000.0,17140,12637,3.85,3.80
1,E10000006,Cumbria,1997-01-01,50000.0,35000.0,16118,11244,3.10,3.11
2,E10000007,Derbyshire,1997-01-01,49000.0,36000.0,15371,11448,3.19,3.14
3,E10000008,Devon,1997-01-01,60000.0,45000.0,14203,10456,4.22,4.30
4,E10000011,East Sussex,1997-01-01,63000.0,45000.0,15330,11051,4.11,4.07
...,...,...,...,...,...,...,...,...,...
619,E10000029,Suffolk,2022-01-01,280000.0,215000.0,31414,23617,8.91,9.10
620,E10000030,Surrey,2022-01-01,500000.0,355000.0,36070,26448,13.86,13.42
621,E10000031,Warwickshire,2022-01-01,280000.0,206000.0,31605,23892,8.86,8.62
622,E10000032,West Sussex,2022-01-01,375000.0,280000.0,31497,24385,11.91,11.48
623,E10000034,Worcestershire,2022-01-01,269975.0,199975.0,29858,22893,9.04,8.74

In [8]:
eng_cym_region_merged.to_csv('../datasets/price_earnings_eng_cym_wrangled.csv', index=False)